# Pandas

In [ ]:
#pandas install
pip install pandas

In [2]:
# pandas import
import pandas as pd

## series

1개의 컬럼 값으로 구성된 1차원 데이터 셋

In [4]:
data = ["A", "B", "C", "D"]
se = pd.Series(data)
se

0    A
1    B
2    C
3    D
dtype: object

In [5]:
# 가져온 데이터의 갯수 파악 
se.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
se.values

array(['A', 'B', 'C', 'D'], dtype=object)

In [7]:
# 인덱싱
print(se[1])
print(se[3])

B
D

In [8]:
# 슬라이싱
print(se[-1:])
print(se[:])

3    D
dtype: object
0    A
1    B
2    C
3    D
dtype: object

In [9]:
# 컬럼 이름 변경
se.name = "alphabet"
se

0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [10]:
# 인덱스 이름 변경
se.index.name ="NO."
se

NO.
0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [11]:
# Series 생성시 index 지정하기
data = [1, 2, 3, 4]

se = pd.Series(data, index=[1,2,3,5])
print(se)
print(se[1])

1    1
2    2
3    3
5    4
dtype: int64
1

In [12]:
# 조건 주기
se > 40

1    False
2    False
3    False
5    False
dtype: bool

# DataFrame

여러 개의 시리즈가 모여있는 것

In [15]:
import numpy as np

data = np.array([[1,2,3], [4,5,6], [7,8,9]])
column = ['D','E','F']

df = pd.DataFrame(data=data, index=['A', 'B', 'C'], columns = column)
df

# df = pd.read_csv("data.csv")
# df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [16]:
# DataFrame 생성
data = {
    'country' : ["kor", "usa", "china", "japan"],
    'rank' : [1,2,3,4],
    'grade' : ["A", "B", "C", "D"]
}

df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [17]:
# df.set_index로 인덱스 지정 - 필터 역할
df = df.set_index('grade')
df

      country  rank
grade
A         kor     1
B         usa     2
C       china     3
D       japan     4

# 데이터 셀렉션

In [18]:
# DataFrame 생성
data = {
    'country' : ["kor", "usa", "china", "japan"],
    'rank' : [1,2,3,4],
    'grade' : ["A", "B", "C","D"]
}

df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [19]:
#(1) df.컬럼, df[컬럼]

# 하나의 컬럼 조회
df.country

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [20]:
df['country'] # 이것을 더 자주 씀

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [21]:
## 둘 이상의 컬럼 조회
# 멀티로 가져온다 = 리스트

print(df[['country', 'grade']]) # 대괄호 2번 감싸야 DF 형식이 된다

  country grade
0     kor     A
1     usa     B
2   china     C
3   japan     D

In [22]:
# (2) loc[인덱스명, 컬럼명] location base

# 인덱스 값이 0인 행 조회
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [23]:
# 2개 이상의 행 조회
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [24]:
df.loc[[0,2]] # 인덱스 값을 지정해 원하는 행의 값을 '여러 개' 가져올 수 있다

  country  rank grade
0     kor     1     A
2   china     3     C

In [25]:
df.loc[0, 'grade'] # 행과 열의 좌표. loc[행, 열] : 0번째 행에서 column값이 'grade'인 값
df.loc[[0], 'grade']

0    A
Name: grade, dtype: object

In [26]:
df.loc[0:2, ['country', 'grade']]

  country grade
0     kor     A
1     usa     B
2   china     C

In [27]:
df.loc[(df['grade'] == "A") | (df['rank'] > 2)]
# true로 뜨는 값만 데이터 프레임에 담긴다.

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

In [29]:
#(3) iloc[행의값인덱스, 칼럼인덱스]

df.iloc[2] # 3행의 데이터 # 전체 데이터 프레임에서 0번째 행에 있는 값

TypeError: Cannot index by location index with a non-integer key

In [30]:
loc = df.loc[0:2] # index 값 # df.loc[0:2]
print(loc)

iloc = df.iloc[0:2] # 행의 범위
print(iloc)

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
  country  rank grade
0     kor     1     A
1     usa     2     B

In [ ]:
df.iloc[0:3, 0:2] #행,열 # iloc는 무조건 정수기반!

In [45]:
# df.iloc[[0, 3], 1:3]
# 1단계, 그냥 iloc로 데이터 몇 개를 불러본다.
# 2단계, 
df.loc[[0,3], ['rank', 'grade']]

   rank grade
0     1     A
3     4     D

# filter() 을 이용한 검색

In [50]:
df.filter?
# ?을 넣으면 예제가 뜬다.

In [51]:
df.filter(items=['country', 'rank', 'item1', 'item2'])

  country  rank
0     kor     1
1     usa     2
2   china     3
3   japan     4

In [52]:
df.filter(like='c', axis=1) # 컬럼명에 c가 포함된 검색

  country
0     kor
1     usa
2   china
3   japan

In [55]:
df.filter(like='r', axis=1) # r이 들어간 컬럼명

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

# Dataframe 추가

In [59]:
# (1) series를 이용해서 열 데이터 추가
president = pd.Series(["yoon", "biden", "kishida", "jinping"], index = [0,1,2,3]) # index값도 정해줘야한다
president

gdp = pd.Series(["1000", "2000", "3000", "4000"], index = [0,1,2,3]) # index값도 정해줘야한다
gdp

df['president'] = president # df에 컬럼열을 만들고 담고 싶은 값을 설정
df['gdp'] = gdp
df

  country  rank grade president   gdp
0     kor     1     A      yoon  1000
1     usa     2     B     biden  2000
2   china     3     C   kishida  3000
3   japan     4     D   jinping  4000

In [62]:
# (2) Numpy를 이용하여 열 데이터 추가
import numpy as np

# add = pd.Series([0,0,0,0], index = [0,1,2,3]) # index값도 정해줘야한다

add = np.zeros(4).astype(int)
df['etc'] = add # 추가하고 싶은 column의 이름을 더한다.
df

  country  rank grade president   gdp  etc
0     kor     1     A      yoon  1000    0
1     usa     2     B     biden  2000    0
2   china     3     C   kishida  3000    0
3   japan     4     D   jinping  4000    0

In [63]:
# (3) 연산을 이용하여 행 데이터 추가

df['rank'] < 3
df['new_grade'] = df['rank'] < 3
df

  country  rank grade president   gdp  etc  new_grade
0     kor     1     A      yoon  1000    0       True
1     usa     2     B     biden  2000    0       True
2   china     3     C   kishida  3000    0      False
3   japan     4     D   jinping  4000    0      False

In [74]:
df.loc[4] = ['singapole', 4, "D", "jao", 1000, 0, False]
df

ValueError: Must have equal len keys and value when setting with an iterable

In [72]:
df = df.reset_index() # 옵션의 기본값이 false라서 안에 담아줘야함
df

   index    country  rank grade president   gdp  etc  new_grade
0      0        kor     1     A      yoon  1000    0       True
1      1        usa     2     B     biden  2000    0       True
2      2      china     3     C   kishida  3000    0      False
3      3      japan     4     D   jinping  4000    0      False
4      7  singapole     4     D       jao  1000    0      False

# DataFrame 삭제

In [76]:
# (1) drop 
# 행삭제

df.drop(index=3) # 실제로 삭제가 되지 않음

   index    country  rank grade president   gdp  etc  new_grade
0      0        kor     1     A      yoon  1000    0       True
1      1        usa     2     B     biden  2000    0       True
2      2      china     3     C   kishida  3000    0      False
4      7  singapole     4     D       jao  1000    0      False

In [77]:
df.drop? # shift + tap 3

   index    country  rank grade president   gdp  etc  new_grade
0      0        kor     1     A      yoon  1000    0       True
1      1        usa     2     B     biden  2000    0       True
2      2      china     3     C   kishida  3000    0      False
3      3      japan     4     D   jinping  4000    0      False
4      7  singapole     4     D       jao  1000    0      False

In [ ]:
df.drop(index=4, inplace=True) # 실제로 삭제해야 함 inplace 옵션 필요

In [ ]:
# 열삭제
df.drop('new_grade', axis = 1) # 기본값 axis = 0, 0이면 index

In [79]:
#(2) del
# 열 삭제
del df['gdp']
df

KeyError: 'gdp'

# pandas 퀴즈

In [82]:
import pandas as pd
data = {
    '영화' : ['명량', '극한직업', '신과함께-죄와벌', '국제시장', '괴물', '도둑들', '7번방의 선물', '암살'],
    '개봉 연도' : [2014, 2019, 2017, 2014, 2006, 2012, 2013, 2015],
    '관객 수' : [1761, 1626, 1441, 1426, 1301, 1298, 1281, 1270], # (단위 : 만 명)
    '평점' : [8.81, 9.20, 8.73, 9.16, 8.62, 7.64, 8.83, 9.10]
}

df = pd.DataFrame(data)
df

         영화  개봉 연도  관객 수    평점
0        명량   2014  1761  8.81
1      극한직업   2019  1626  9.20
2  신과함께-죄와벌   2017  1441  8.73
3      국제시장   2014  1426  9.16
4        괴물   2006  1301  8.62
5       도둑들   2012  1298  7.64
6   7번방의 선물   2013  1281  8.83
7        암살   2015  1270  9.10

In [89]:
# 전체 데이터 중 '영화' 정보
df[['영화']]

         영화
0        명량
1      극한직업
2  신과함께-죄와벌
3      국제시장
4        괴물
5       도둑들
6   7번방의 선물
7        암살

In [136]:
# 전체 데이터 중 '영화', 평점' 정보

df[['영화', '평점']]
df.loc[0:7, ['영화', '평점']]

         영화    평점
0        명량  8.81
1      극한직업  9.20
2  신과함께-죄와벌  8.73
3      국제시장  9.16
4        괴물  8.62
5       도둑들  7.64
6   7번방의 선물  8.83
7        암살  9.10

In [139]:
# 2015년도 이후에 개봉한 영화의 '영화', '정보'


#(1)
df[df['개봉 연도'] > 2015][['영화', '평점']]

#(2) df.loc
a = df['개봉 연도'] > 2015 #시리즈 형태

df.loc[a, ['영화', '개봉 연도']]

         영화  개봉 연도
1      극한직업   2019
2  신과함께-죄와벌   2017

# 추천 점수 column 추가
추천 점수 = (관객수 * 평점)//100

In [144]:
(df['관객 수'] * df['평점'])// 100
# 갯수가 같아서 계산이 가능하다.

0    155.0
1    149.0
2    125.0
3    130.0
4    112.0
5     99.0
6    113.0
7    115.0
dtype: float64

In [145]:
df['추천 점수'] =(df['관객 수'] * df['평점'])// 100
df

         영화  개봉 연도  관객 수    평점  추천 점수
0        명량   2014  1761  8.81  155.0
1      극한직업   2019  1626  9.20  149.0
2  신과함께-죄와벌   2017  1441  8.73  125.0
3      국제시장   2014  1426  9.16  130.0
4        괴물   2006  1301  8.62  112.0
5       도둑들   2012  1298  7.64   99.0
6   7번방의 선물   2013  1281  8.83  113.0
7        암살   2015  1270  9.10  115.0

## 전체 데이터를 '개봉 연도' 기준으로 내림차순

In [146]:
df.sort_values('개봉 연도')
# 모르면 검색 !!!!

         영화  개봉 연도  관객 수    평점  추천 점수
4        괴물   2006  1301  8.62  112.0
5       도둑들   2012  1298  7.64   99.0
6   7번방의 선물   2013  1281  8.83  113.0
0        명량   2014  1761  8.81  155.0
3      국제시장   2014  1426  9.16  130.0
7        암살   2015  1270  9.10  115.0
2  신과함께-죄와벌   2017  1441  8.73  125.0
1      극한직업   2019  1626  9.20  149.0

In [148]:
df.sort_values('개봉 연도', ascending = False)

         영화  개봉 연도  관객 수    평점  추천 점수
1      극한직업   2019  1626  9.20  149.0
2  신과함께-죄와벌   2017  1441  8.73  125.0
7        암살   2015  1270  9.10  115.0
0        명량   2014  1761  8.81  155.0
3      국제시장   2014  1426  9.16  130.0
6   7번방의 선물   2013  1281  8.83  113.0
5       도둑들   2012  1298  7.64   99.0
4        괴물   2006  1301  8.62  112.0